[{
    "name": "7FR/RS/CC",
    "tutor": "Mrs O’Connell",
    "studentText": "<p>We got off to a rough start: Max cried when he got 7/9 in a French test; Mr Ramadhar-Singh made Sachin cry in our first Physics lesson; Mr Narey made us all cry with his talks about littering. Other early memories include the day Abhishek missed period one Drama with Mr Skerten but turned up to his English lesson period two, thinking time passes slower than it actually does.</p><p>Paddy and Lewis thrived from the beginning with their cookie business (one for 40p, three for a pound anyone?). Presentations on our hobbies saw Al teach us about a fictitious animal, the ‘Menguineaver’. Ole’s solo in our Year 7 performance of ‘You Raise Me Up’ was only surpassed in the Year 10 Battle of the Bands by Al and Lewis’ rendition of their own composition ‘Turn Off the Lights’ (ahem, Euan… ).</p><p>Year 8 saw our new tutor, Mr Shaw, use his catchphrase ‘hellfire damnation’ for our lamentable independent study folders, as well as for rants at Conor. We even faced the hellfire; listening to Moo and Abhishek’s arguments about who would make the better doctor was scalding, as was sex-ed when we heard Mr Shaw graphically recount his wet-dream experiences as a teenager. Mr Howes gave up on our anonymous questions in Biology when someone asked if he’d had sex. (That said, we did learn a lot about broken dicks.)</p><p>CC taught us the dangers of mispronunciation. Akil’s attempts to verbalise ‘development’ (“de-vil-UP-ment”) as he read out an article about tsunamis had us in stiches the entire lesson. In Year 9, Miss Shirley’s repeated mispronunciation of ‘Sachin’ (partly due to Hasan) saw one lesson end with Sachin trapping Hasan in a headlock, who split his knuckle in an attempt to punch his way out of it. </p><p>CC might never have understood things like Caderyn’s unconditional love for Al or his ‘allergy’ to cotton wool but sometimes in life it’s when you don’t know the answers that you realise the questions Caderyn makes you ask are just f***ing weird.</p><p>While change defined our first few years as a form, one thing remained constant throughout our time together: there seemed to be an unquestionable sense of camaraderie, friendship, and unity, which stays with us to this day. Despite the diverse range of backgrounds, personalities, and interests that were present in the group and the different directions which we have since taken in our lives, there is no doubt that CC had a formative effect on each and every one of us. Our time together will be dearly missed.</p>",
    "studentTextAuthor": "Hasan Amin, Euan Carter"
}]
